
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>日本語 · Foxlottery Whitepaper</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="en.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" >
            
                <a target="_blank" href="https://www.foxlottery.org">
            
                    
                    Foxlottery
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    Whitepaper
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="en.html">
            
                <a href="en.html">
            
                    
                    English
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="ja.html">
            
                <a href="ja.html">
            
                    
                    日本語
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >日本語</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="foxlottery">Foxlottery</h1>
<p><img src="img/header-logs.png" alt=""></p>
<h1 id="&#x6982;&#x8981;">&#x6982;&#x8981;</h1>
<p>FoxLottery&#x306F;&#x6697;&#x53F7;&#x8CC7;&#x7523;&#x3068;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30B3;&#x30F3;&#x30C8;&#x30E9;&#x30AF;&#x30C8;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x305F;&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x5B9D;&#x304F;&#x3058;&#x3067;&#x3059;&#x3002;</p>
<p>&#x4E16;&#x754C;&#x4E2D;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x3059;&#x308B;&#x81EA;&#x6CBB;&#x4F53;&#x304C;&#x3001;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x60F3;&#x5B9A;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>&#x5B9D;&#x304F;&#x3058;&#x306E;&#x9084;&#x5143;&#x7387;&#x3084;&#x57FA;&#x6E96;&#x306B;&#x3059;&#x308B;ERC20&#x30C8;&#x30FC;&#x30AF;&#x30F3;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x30B5;&#x30A4;&#x30AF;&#x30EB;&#x3092;&#x8A2D;&#x5B9A;&#x3057;&#x3066;&#x3001;&#x3059;&#x3050;&#x306B;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x59CB;&#x3081;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p>&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304B;&#x3089;&#x53CE;&#x96C6;&#x3057;&#x305F;ERC20&#x30C8;&#x30FC;&#x30AF;&#x30F3;&#x3092;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x306A;&#x5F53;&#x305B;&#x3093;&#x8005;&#x306B;&#x5206;&#x914D;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p>&#x5F53;&#x305B;&#x3093;&#x8005;&#x306E;&#x6C7A;&#x5B9A;&#x306F;Chainlink VRF&#x3092;&#x4F7F;&#x3044;&#x3001;&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x4E0A;&#x3067;&#x4E71;&#x6570;&#x3092;&#x751F;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;
<a href="https://docs.chain.link/docs/chainlink-vrf/" target="_blank">https://docs.chain.link/docs/chainlink-vrf/</a></p>
<h1 id="&#x30D3;&#x30B8;&#x30E7;&#x30F3;">&#x30D3;&#x30B8;&#x30E7;&#x30F3;</h1>
<h3 id="&#x5206;&#x6563;&#x578B;&#x5B9D;&#x304F;&#x3058;&#x3067;&#x793E;&#x4F1A;&#x3092;&#x3088;&#x308A;&#x826F;&#x304F;&#x3059;&#x308B;">&#x5206;&#x6563;&#x578B;&#x5B9D;&#x304F;&#x3058;&#x3067;&#x793E;&#x4F1A;&#x3092;&#x3088;&#x308A;&#x826F;&#x304F;&#x3059;&#x308B;</h3>
<h1 id="&#x5206;&#x6563;&#x578B;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x30E1;&#x30EA;&#x30C3;&#x30C8;">&#x5206;&#x6563;&#x578B;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x30E1;&#x30EA;&#x30C3;&#x30C8;</h1>
<h4 id="&#x5F53;&#x305B;&#x3093;&#x8005;&#x306E;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x6027;&#x306E;&#x62C5;&#x4FDD;">&#x5F53;&#x305B;&#x3093;&#x8005;&#x306E;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x6027;&#x306E;&#x62C5;&#x4FDD;</h4>
<p>&#x3053;&#x308C;&#x307E;&#x3067;&#x306F;&#x56FD;&#x6C11;&#x304C;&#x653F;&#x5E9C;&#x3092;&#x4FE1;&#x7528;&#x3057;&#x3066;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x5F53;&#x305B;&#x3093;&#x8005;&#x3092;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x3067;&#x5F53;&#x9078;&#x8005;&#x306E;&#x6C7A;&#x5B9A;&#x3092;&#x3057;&#x3066;&#x3044;&#x308B;&#x3068;&#x4FE1;&#x7528;&#x3057;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;
&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x3092;&#x4F7F;&#x3048;&#x3070;&#x3001;&#x653F;&#x5E9C;&#x3092;&#x4FE1;&#x7528;&#x3057;&#x306A;&#x304F;&#x3066;&#x3082;&#x3001;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x4FE1;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x56FD;&#x6C11;&#x304C;&#x3088;&#x308A;&#x5B9D;&#x304F;&#x3058;&#x306B;&#x53C2;&#x52A0;&#x3057;&#x3084;&#x3059;&#x304F;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<h4 id="&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x304C;&#x9AD8;&#x3044;">&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x304C;&#x9AD8;&#x3044;</h4>
<p>&#x30AA;&#x30FC;&#x30D7;&#x30F3;&#x30BD;&#x30FC;&#x30B9;&#x3067;&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x3057;&#x3066;&#x3044;&#x308B;&#x3068;&#x30D0;&#x30B0;&#x306E;&#x898B;&#x3064;&#x304B;&#x308B;&#x901F;&#x5EA6;&#x304C;&#x901F;&#x304F;&#x3001;&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3001;&#x30CF;&#x30C3;&#x30AD;&#x30F3;&#x30B0;&#x304C;&#x8D77;&#x304D;&#x3065;&#x3089;&#x3044;&#x3002;</p>
<h4 id="&#x8CC7;&#x91D1;&#x306E;&#x8FFD;&#x8DE1;&#x53EF;&#x80FD;&#x6027;">&#x8CC7;&#x91D1;&#x306E;&#x8FFD;&#x8DE1;&#x53EF;&#x80FD;&#x6027;</h4>
<p>&#x3069;&#x306E;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x306B;&#x3069;&#x308C;&#x304F;&#x3089;&#x3044;&#x306E;&#x91CF;&#x3092;&#x9001;&#x91D1;&#x3057;&#x305F;&#x306E;&#x304B;&#x3001;&#x898B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<h4 id="&#x30AA;&#x30FC;&#x30D7;&#x30F3;&#x30BD;&#x30FC;&#x30B9;">&#x30AA;&#x30FC;&#x30D7;&#x30F3;&#x30BD;&#x30FC;&#x30B9;</h4>
<p>&#x30AA;&#x30FC;&#x30D7;&#x30F3;&#x30BD;&#x30FC;&#x30B9;&#x306B;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x4E16;&#x754C;&#x5404;&#x56FD;&#x306E;&#x653F;&#x5E9C;&#x304C;&#x72EC;&#x81EA;&#x3067;&#x30AA;&#x30F3;&#x30E9;&#x30A4;&#x30F3;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x958B;&#x767A;&#x3057;&#x306A;&#x304F;&#x3066;&#x3082;&#x3001;&#x4E16;&#x754C;&#x4E2D;&#x3067;&#x540C;&#x3058;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x4F7F;&#x3048;&#x307E;&#x3059;&#x3002;&#x30CB;&#x30FC;&#x30BA;&#x304C;&#x3042;&#x308B;&#x6A5F;&#x80FD;&#x304C;&#x3042;&#x308C;&#x3070;&#x3001;&#x3069;&#x3053;&#x304B;&#x306E;&#x56FD;&#x304C;&#x6A5F;&#x80FD;&#x8FFD;&#x52A0;&#x3057;&#x3066;&#x3001;&#x305D;&#x308C;&#x306F;&#x4E16;&#x754C;&#x5404;&#x56FD;&#x306B;&#x5171;&#x6709;&#x3055;&#x308C;&#x3001;&#x305D;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x4F7F;&#x3044;&#x305F;&#x3044;&#x5834;&#x5408;&#x3001;&#x3059;&#x3050;&#x306B;&#x4F7F;&#x3048;&#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<h1 id="&#x30AA;&#x30F3;&#x30E9;&#x30A4;&#x30F3;&#x5B9D;&#x304F;&#x3058;&#x3068;&#x3001;&#x5206;&#x6563;&#x578B;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x9055;&#x3044;">&#x30AA;&#x30F3;&#x30E9;&#x30A4;&#x30F3;&#x5B9D;&#x304F;&#x3058;&#x3068;&#x3001;&#x5206;&#x6563;&#x578B;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x9055;&#x3044;</h1>
<table>
<thead>
<tr>
<th></th>
<th>&#x5206;&#x6563;&#x578B;&#x5B9D;&#x304F;&#x3058;</th>
<th>&#x30AA;&#x30F3;&#x30E9;&#x30A4;&#x30F3;&#x5B9D;&#x304F;&#x3058;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x30BD;&#x30FC;&#x30B9;&#x30B3;&#x30FC;&#x30C9;</td>
<td>&#x30AA;&#x30FC;&#x30D7;&#x30F3;</td>
<td>&#x30AF;&#x30ED;&#x30FC;&#x30BA;&#x30C9;</td>
</tr>
<tr>
<td>&#x6C7A;&#x6E08;&#x624B;&#x6BB5;</td>
<td>ERC20 &#x30C8;&#x30FC;&#x30AF;&#x30F3;</td>
<td>&#x30AF;&#x30EC;&#x30B8;&#x30C3;&#x30C8;&#x30AB;&#x30FC;&#x30C9;&#x3001;&#x53E3;&#x5EA7;&#x632F;&#x8FBC;</td>
</tr>
<tr>
<td>&#x5F53;&#x9078;&#x8005;&#x306E;&#x6C7A;&#x5B9A;&#x65B9;&#x6CD5;</td>
<td>&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x4E0A;&#x306E;&#x4E71;&#x6570;&#x751F;&#x6210;</td>
<td>&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x4E0A;&#x306E;&#x4E71;&#x6570;&#x751F;&#x6210;</td>
</tr>
<tr>
<td>&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;</td>
<td>&#x9AD8;&#x3044;</td>
<td>&#x666E;&#x901A;</td>
</tr>
<tr>
<td>&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x30B3;&#x30B9;&#x30C8;</td>
<td>&#x4F4E;&#x3044;</td>
<td>&#x9AD8;&#x3044;</td>
</tr>
<tr>
<td>&#x8CA9;&#x58F2;&#x30C1;&#x30E3;&#x30CD;&#x30EB;</td>
<td>web, &#x30A2;&#x30D7;&#x30EA;&#x3001;&#x30E1;&#x30BF;&#x30D0;&#x30FC;&#x30B9;</td>
<td>web</td>
</tr>
<tr>
<td>&#x8CC7;&#x91D1;&#x306E;&#x8FFD;&#x8DE1;&#x53EF;&#x80FD;&#x6027;</td>
<td>&#x3042;&#x308B;</td>
<td>&#x306A;&#x3044;</td>
</tr>
<tr>
<td>&#x53C2;&#x52A0;&#x8005;&#x304C;&#x904B;&#x55B6;&#x3092;&#x4FE1;&#x7528;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x6027;</td>
<td>&#x306A;&#x3044;</td>
<td>&#x3042;&#x308B;</td>
</tr>
<tr>
<td>DDos&#x653B;&#x6483;&#x8010;&#x6027;</td>
<td>&#x3042;&#x308B;</td>
<td>&#x306A;&#x3044;</td>
</tr>
<tr>
<td>&#x30D7;&#x30E9;&#x30A4;&#x30D0;&#x30B7;&#x30FC;</td>
<td>&#x3042;&#x308B;</td>
<td>&#x306A;&#x3044;</td>
</tr>
<tr>
<td>&#x30ED;&#x30B0;&#x30A4;&#x30F3;&#x65B9;&#x6CD5;</td>
<td>&#x4EEE;&#x60F3;&#x901A;&#x8CA8;&#x30A6;&#x30A9;&#x30EC;&#x30C3;&#x30C8;(metamask&#x306A;&#x3069;)</td>
<td>&#x30E1;&#x30FC;&#x30EB;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x3001;&#x96FB;&#x8A71;&#x756A;&#x53F7;</td>
</tr>
</tbody>
</table>
<h1 id="&#x30E6;&#x30FC;&#x30B9;&#x30B1;&#x30FC;&#x30B9;">&#x30E6;&#x30FC;&#x30B9;&#x30B1;&#x30FC;&#x30B9;</h1>
<h1 id="pay-to-lottery">pay to lottery</h1>
<p>&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304C;&#x304A;&#x91D1;&#x3092;&#x6255;&#x3046;&#x5B9D;&#x304F;&#x3058;</p>
<p>&#x6CD5;&#x7684;&#x898F;&#x5236;: &#x5B9D;&#x304F;&#x3058;&#x306F;&#x3001;&#x6CD5;&#x5F8B;&#x4E0A;&#x5168;&#x3066;&#x306E;&#x56FD;&#x3067;&#x6C11;&#x9593;&#x4F01;&#x696D;&#x304C;&#x3067;&#x304D;&#x306A;&#x3044;</p>
<p>&#x53C2;&#x5165;&#x969C;&#x58C1;: &#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x3092;&#x4F7F;&#x3063;&#x305F;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x4E8B;&#x4F8B;&#x304C;&#x306A;&#x3044;&#x306E;&#x3067;&#x5C0E;&#x5165;&#x3057;&#x305A;&#x3089;&#x3044;</p>
<ul>
<li>world wide lottery</li>
<li>&#x653F;&#x5E9C;&#x7CFB;&#x5B9D;&#x304F;&#x3058;</li>
<li>credit card pay to &#x5B9D;&#x304F;&#x3058;</li>
</ul>
<h3 id="world-wide-lottery">world wide lottery</h3>
<p>&#x56FD;&#x5883;&#x304C;&#x306A;&#x304F;&#x4E16;&#x754C;&#x4E2D;&#x306E;&#x4EBA;&#x304C;&#x53C2;&#x52A0;&#x3067;&#x304D;&#x308B;&#x5B9D;&#x304F;&#x3058;&#x3002;
&#x5B9D;&#x304F;&#x3058;&#x3088;&#x3063;&#x3066;&#x5F97;&#x3089;&#x308C;&#x308B;&#x5229;&#x76CA;&#x306F;&#x3001;&#x5404;&#x56FD;&#x306B;&#x7A0E;&#x53CE;&#x306B;&#x306A;&#x308B;&#x3002;
&#x4F8B;&#x3048;&#x3070;&#x3001;&#x30A2;&#x30E1;&#x30EA;&#x30AB;&#x4EBA;&#x304C;&#x8CB7;&#x3063;&#x305F;&#x5B9D;&#x304F;&#x3058;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x306E;&#x6599;&#x91D1;&#x306E;50%&#x306F;&#x30A2;&#x30E1;&#x30EA;&#x30AB;&#x306E;&#x7A0E;&#x91D1;&#x3068;&#x3057;&#x3066;&#x3001;&#x9001;&#x91D1;&#x3055;&#x308C;&#x3001;&#x6B8B;&#x308A;50%&#x304C;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x8CDE;&#x91D1;&#x3068;&#x3057;&#x3066;&#x3001;&#x4F7F;&#x308F;&#x308C;&#x308B;&#x3002;
&#x5168;&#x4E16;&#x754C;&#x304B;&#x3089;&#x304A;&#x91D1;&#x3092;&#x96C6;&#x3081;&#x3066;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x3059;&#x308B;&#x306E;&#x3067;&#x3001;&#x5F53;&#x9078;&#x91D1;&#x306F;&#x591A;&#x304F;&#x306A;&#x308A;&#x3001;&#x53C2;&#x52A0;&#x8005;&#x306F;&#x5897;&#x3048;&#x3001;&#x5404;&#x56FD;&#x306E;&#x7A0E;&#x53CE;&#x3082;&#x591A;&#x304F;&#x306A;&#x308B;&#x3002;</p>
<h3 id="&#x653F;&#x5E9C;&#x7CFB;&#x5B9D;&#x304F;&#x3058;">&#x653F;&#x5E9C;&#x7CFB;&#x5B9D;&#x304F;&#x3058;</h3>
<p>&#x653F;&#x5E9C;&#x304C;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x767A;&#x884C;&#x3057;&#x3066;&#x3001;&#x56FD;&#x6C11;&#x304C;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x8CFC;&#x5165;&#x3057;&#x3066;&#x3001;&#x653F;&#x5E9C;&#x306F;&#x7A0E;&#x53CE;&#x3092;&#x78BA;&#x4FDD;&#x3059;&#x308B;</p>
<p><strong>&#x8AB2;&#x984C;</strong></p>
<p>&#x900F;&#x660E;&#x6027;&#x304C;&#x306A;&#x3044;&#x3002;
&#x4FE1;&#x7528;&#x306E;&#x306A;&#x3044;&#x56FD;&#x3067;&#x306F;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x306F;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;</p>
<h3 id="credit-card-pay-to-&#x5B9D;&#x304F;&#x3058;">credit card pay to &#x5B9D;&#x304F;&#x3058;</h3>
<p>&#x5B9D;&#x304F;&#x3058;&#x306E;&#x904B;&#x55B6;&#x304C;&#x3001;&#x30AF;&#x30EC;&#x30B8;&#x30C3;&#x30C8;&#x30AB;&#x30FC;&#x30C9;&#x3092;&#x767A;&#x884C;&#x3057;&#x3066;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306B;&#x914D;&#x5E03;&#x3057;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306F;&#x666E;&#x901A;&#x306E;&#x30AB;&#x30FC;&#x30C9;&#x3068;&#x540C;&#x3058;&#x3088;&#x3046;&#x306B;&#x8CB7;&#x3044;&#x7269;&#x3092;&#x3059;&#x308B;&#x3002;
&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304C;&#x8CB7;&#x3044;&#x7269;&#x3092;&#x3059;&#x308B;&#x3068;&#x3001;&#x30AB;&#x30FC;&#x30C9;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x7BA1;&#x7406;&#x3057;&#x3066;&#x3044;&#x308B;&#x4F1A;&#x793E;(visa, master)&#x304C;&#x3001;&#x4F7F;&#x7528;&#x91CF;&#x306E;1.75% &#x3092;&#x30AB;&#x30FC;&#x30C9;&#x767A;&#x884C;&#x4F1A;&#x793E;&#x306B;&#x624B;&#x6570;&#x6599;&#x3068;&#x3057;&#x3066;&#x652F;&#x6255;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>&#x3053;&#x306E;&#x624B;&#x6570;&#x6599;&#x304B;&#x3089;&#x5132;&#x3051;&#x305F;&#x5229;&#x76CA;&#x3092;&#x53CE;&#x76CA;&#x306E;&#x4E00;&#x90E8;&#x3092;&#x5B9D;&#x304F;&#x3058;&#x3068;&#x3057;&#x3066;&#x3001;&#x5206;&#x914D;&#x3059;&#x308B;&#x3002;</p>
<p>&#x30AB;&#x30FC;&#x30C9;&#x767A;&#x884C;&#x4F1A;&#x793E;&#x306F;&#x4F1A;&#x54E1;&#x3092;&#x96C6;&#x3081;&#x308B;&#x305F;&#x3081;&#x306B;&#x3001;&#x30DD;&#x30A4;&#x30F3;&#x30C8;&#x5236;&#x5EA6;&#x306A;&#x3069;&#x3092;&#x53D6;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<p>visa&#x306E;&#x30AB;&#x30FC;&#x30C9;&#x767A;&#x884C;&#x4F1A;&#x793E;&#x3092;issuer&#x3068;&#x3044;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p><a href="https://www.visaeurope.lu/en_LU/partner-with-us/info-for-partners/info-for-issuers.html" target="_blank">https://www.visaeurope.lu/en_LU/partner-with-us/info-for-partners/info-for-issuers.html</a></p>
<p>&#x3053;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x3067;&#x306F;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306F;&#x640D;&#x5931;&#x304C;&#x306A;&#x304F;&#x5B9D;&#x304F;&#x3058;&#x306B;&#x53C2;&#x52A0;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p>&#x666E;&#x6BB5;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x30AB;&#x30FC;&#x30C9;&#x3092;&#x5B9D;&#x304F;&#x3058;&#x30AF;&#x30EC;&#x30B8;&#x30C3;&#x30C8;&#x30AB;&#x30FC;&#x30C9;&#x306B;&#x5909;&#x3048;&#x308B;&#x3060;&#x3051;&#x3067;&#x3001;&#x5104;&#x4E07;&#x9577;&#x8005;&#x306B;&#x306A;&#x308B;&#x9053;&#x304C;&#x8AB0;&#x306B;&#x3082;&#x3067;&#x958B;&#x304B;&#x308C;&#x308B;&#x306E;&#x3067;&#x3059;&#x3002;</p>
<p><strong>&#x8AB2;&#x984C;</strong></p>
<p>&#x30AF;&#x30EC;&#x30B8;&#x30C3;&#x30C8;&#x30AB;&#x30FC;&#x30C9;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x5C11;&#x984D;&#x306E;&#x30DD;&#x30A4;&#x30F3;&#x30C8;&#x3092;&#x3082;&#x3089;&#x3046;&#x3088;&#x308A;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x3088;&#x3046;&#x306B;&#x5F53;&#x305F;&#x3063;&#x305F;&#x3089;&#x3001;&#x305F;&#x304F;&#x3055;&#x3093;&#x3082;&#x3089;&#x3048;&#x308B;&#x65B9;&#x306B;&#x304B;&#x3051;&#x305F;&#x3044;&#x3002;</p>
<hr>
<h1 id="no-pay-to-lottery">no pay to lottery</h1>
<p>&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304C;&#x304A;&#x91D1;&#x3092;&#x6255;&#x308F;&#x306A;&#x3044;&#x5B9D;&#x304F;&#x3058;</p>
<p>&#x6CD5;&#x7684;&#x898F;&#x5236;: &#x306A;&#x3044;</p>
<p>&#x53C2;&#x5165;&#x969C;&#x58C1;: &#x306A;&#x3044;</p>
<ul>
<li>something trigger lottery</li>
<li>&#x7D44;&#x7E54;&#x5185;&#x5B9D;&#x304F;&#x3058;</li>
</ul>
<h3 id="something-trigger-lottery">something trigger lottery</h3>
<p>twitter&#x306E;&#x30EA;&#x30C4;&#x30A4;&#x30FC;&#x30C8;&#x3084;&#x3001;&#x30DC;&#x30E9;&#x30F3;&#x30C6;&#x30A3;&#x30A2;&#x3084;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x3078;&#x306E;&#x53C2;&#x52A0;&#x306A;&#x3069;</p>
<p>&#x4F55;&#x3092;&#x30C8;&#x30EA;&#x30AC;&#x30FC;&#x306B;&#x3057;&#x3066;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x914D;&#x5E03;&#x3059;&#x308B;&#x306E;&#x304B;&#x306F;&#x3001;developer&#x304C;&#x81EA;&#x7531;&#x306B;&#x958B;&#x767A;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p><strong>&#x8AB2;&#x984C;</strong></p>
<p>&#x5C0F;&#x3055;&#x3044;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3067;&#x3001;&#x4F55;&#x304B;&#x3092;&#x3059;&#x308B;&#x3068;&#x304D;&#x306B;&#x5927;&#x304D;&#x306A;&#x30A4;&#x30F3;&#x30BB;&#x30F3;&#x30C6;&#x30A3;&#x30D6;&#x3092;&#x3001;&#x53C2;&#x52A0;&#x8005;&#x306B;&#x4E0E;&#x3048;&#x308B;&#x3053;&#x3068;&#x306F;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;</p>
<p>twitter&#x306E;&#x30EA;&#x30C4;&#x30A4;&#x30FC;&#x30C8;&#x4F01;&#x753B;&#x306A;&#x3069;&#x306F;&#x305F;&#x304F;&#x3055;&#x3093;&#x898B;&#x3089;&#x308C;&#x307E;&#x3059;&#x304C;&#x3001;&#x305D;&#x306E;&#x591A;&#x304F;&#x304C;&#x3001;&#x672C;&#x5F53;&#x306B;&#x30D7;&#x30EC;&#x30BC;&#x30F3;&#x30C8;&#x3084;&#x304A;&#x91D1;&#x3092;&#x914D;&#x5E03;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x304B;&#x3001;&#x5F53;&#x9078;&#x8005;&#x3092;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x306B;&#x5F53;&#x9078;&#x3055;&#x305B;&#x3066;&#x3044;&#x308B;&#x306E;&#x304B;&#x306F;&#x3001;&#x308F;&#x304B;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;</p>
<h3 id="&#x7D44;&#x7E54;&#x5185;&#x5B9D;&#x304F;&#x3058;">&#x7D44;&#x7E54;&#x5185;&#x5B9D;&#x304F;&#x3058;</h3>
<p>&#x4F1A;&#x793E;&#x306A;&#x3069;&#x3067;&#x3001;&#x826F;&#x3044;&#x50CD;&#x304D;&#x3092;&#x3057;&#x305F;&#x4EBA;&#x306B;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x914D;&#x5E03;&#x3057;, &#x6708;&#x672B;&#x3084;&#x5E74;&#x672B;&#x306B;&#x5229;&#x76CA;&#x306E;&#x4E00;&#x90E8;&#x3092;&#x5F53;&#x9078;&#x8005;&#x306B;&#x9001;&#x91D1;&#x3059;&#x308B;
&#x7D44;&#x7E54;&#x5185;&#x3067;&#x50CD;&#x304F;&#x3053;&#x3068;&#x306E;&#x30A4;&#x30F3;&#x30BB;&#x30F3;&#x30C6;&#x30A3;&#x30D6;&#x3092;&#x4F5C;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;</p>
<p><strong>&#x4EE3;&#x66FF;&#x5143;</strong></p>
<p>&#x30B9;&#x30C8;&#x30C3;&#x30AF;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3001;&#x30DC;&#x30FC;&#x30CA;&#x30B9;&#x3001;&#x6848;&#x4EF6;&#x3054;&#x3068;&#x306E;&#x30A4;&#x30F3;&#x30BB;&#x30F3;&#x30C6;&#x30A3;&#x30D6;</p>
<p><strong>&#x8AB2;&#x984C;</strong></p>
<p>&#x30B9;&#x30C8;&#x30C3;&#x30AF;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x30A4;&#x30F3;&#x30BB;&#x30F3;&#x30C6;&#x30A3;&#x30D6;&#x306F;&#x4E0A;&#x5834;&#x3059;&#x308B;&#x307E;&#x3067;&#x306B;&#x6570;&#x5E74;&#x304B;&#x304B;&#x308A;&#x3001;&#x30A4;&#x30F3;&#x30BB;&#x30F3;&#x30C6;&#x30A3;&#x30D6;&#x304C;&#x53CD;&#x6620;&#x3055;&#x308C;&#x308B;&#x307E;&#x3067;&#x306B;&#x6642;&#x9593;&#x304C;&#x304B;&#x304B;&#x308B;&#x3002;
&#x4E00;&#x6848;&#x4EF6;&#x7372;&#x5F97;&#x3054;&#x3068;&#x306B;&#x30BB;&#x30FC;&#x30EB;&#x30B9;&#x30DE;&#x30F3;&#x306B;&#x30A4;&#x30F3;&#x30BB;&#x30F3;&#x30C6;&#x30A3;&#x30D6;&#x3092;&#x4E0A;&#x3052;&#x308B;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;&#x3068;&#x7D44;&#x7E54;&#x5185;&#x3067;&#x306E;&#x5354;&#x529B;&#x3092;&#x4FC3;&#x3059;&#x3053;&#x3068;&#x306F;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;</p>
<h1 id="&#x30ED;&#x30FC;&#x30C9;&#x30DE;&#x30C3;&#x30D7;">&#x30ED;&#x30FC;&#x30C9;&#x30DE;&#x30C3;&#x30D7;</h1>
<p>2022&#x5E74; 7&#x6708; &#x30C6;&#x30B9;&#x30C8;&#x30CD;&#x30C3;&#x30C8;&#x306B;&#x30ED;&#x30FC;&#x30F3;&#x30C1;</p>
<p>2022&#x5E74; 8&#x6708; lottery smart contract&#x3092;EIP&#x306B;&#x63D0;&#x6848;, twitter&#x3067;&#x30EA;&#x30C4;&#x30A4;&#x30FC;&#x30C8;&#x4F01;&#x753B;&#x3067;&#x5B9F;&#x9A13;&#x3092;&#x958B;&#x59CB;</p>
<p>2022&#x5E74; 9&#x6708; &#x5404;&#x56FD;&#x653F;&#x5E9C;&#x3001;&#x81EA;&#x6CBB;&#x4F53;&#x306B;&#x5C0E;&#x5165;&#x3092;&#x63D0;&#x6848;</p>
<p>2024&#x5E74; &#x8907;&#x6570;&#x306E;&#x653F;&#x5E9C;&#x3001;&#x81EA;&#x6CBB;&#x4F53;&#x304C;&#x5C0E;&#x5165;&#x3057;&#x305F;&#x3089;&#x3001;world wide lottery&#x8CA1;&#x56E3;&#x3092;&#x8A2D;&#x7ACB;&#x3057;&#x3066;&#x3001;&#x5171;&#x540C;&#x3067;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x3059;&#x308B;</p>
<h1 id="&#x5B9D;&#x304F;&#x3058;&#x306E;&#x6B74;&#x53F2;">&#x5B9D;&#x304F;&#x3058;&#x306E;&#x6B74;&#x53F2;</h1>
<p>&#x6B74;&#x53F2;&#x4E0A;&#x6700;&#x53E4;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x306F;&#x3001;&#x7D00;&#x5143;&#x524D;206&#x5E74;&#x3001;&#x6F22;&#x306E;&#x6642;&#x4EE3;&#x306E;&#x4E2D;&#x56FD;&#x3067;&#x3001;&#x5289;&#x90A6;&#x306E;&#x8ECD;&#x5E2B;&#x3092;&#x52D9;&#x3081;&#x305F;&#x5F35;&#x826F;&#x3068;&#x3044;&#x3046;&#x4EBA;&#x7269;&#x304C;&#x5B9F;&#x65BD;&#x3057;&#x305F;&#x300C;&#x767D;&#x9CE9;&#x7968;&#x300D;&#x3060;&#x3068;&#x8A00;&#x308F;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x5B9F;&#x65BD;&#x3057;&#x305F;&#x306E;&#x306F;&#x3001;&#x4E07;&#x91CC;&#x306E;&#x9577;&#x57CE;&#x3092;&#x5EFA;&#x8A2D;&#x3059;&#x308B;&#x8CA1;&#x6E90;&#x78BA;&#x4FDD;&#x306E;&#x305F;&#x3081;&#x3060;&#x3063;&#x305F;&#x305D;&#x3046;&#x3067;&#x3059;&#x3002;</p>
<p>&#x30E8;&#x30FC;&#x30ED;&#x30C3;&#x30D1;&#x3067;&#x306F;&#x30ED;&#x30FC;&#x30DE;&#x5E1D;&#x56FD;&#x6642;&#x4EE3;&#x306B;&#x6559;&#x4F1A;&#x304C;&#x3001;&#x5EFA;&#x8A2D;&#x8CBB;&#x7528;&#x8ABF;&#x9054;&#x306E;&#x305F;&#x3081;&#x306B;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x3057;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x65E5;&#x672C;&#x3067;&#x306F;&#x6C5F;&#x6238;&#x6642;&#x4EE3;&#x306B;&#x3001;&#x304A;&#x5BFA;&#x304C;&#x8CC7;&#x91D1;&#x8ABF;&#x9054;&#x306E;&#x305F;&#x3081;&#x306B;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>&#x3057;&#x304B;&#x3057;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x306F;&#x904B;&#x55B6;&#x6BCD;&#x4F53;&#x306B;&#x4E0D;&#x6B63;&#x304C;&#x591A;&#x304F;&#x51FA;&#x3066;&#x3057;&#x307E;&#x3044;&#x3001;&#x66B4;&#x52D5;&#x306B;&#x306A;&#x308B;&#x4E8B;&#x4EF6;&#x304C;&#x3001;&#x65E5;&#x672C;&#x3084;&#x30A2;&#x30E1;&#x30EA;&#x30AB;&#x3067;&#x767A;&#x751F;&#x3057;&#x305F;&#x305F;&#x3081;&#x3001;1900&#x5E74;&#x524D;&#x5F8C;&#x306B;&#x5B9D;&#x304F;&#x3058;&#x306F;&#x6CD5;&#x5F8B;&#x3067;&#x7981;&#x6B62;&#x3055;&#x308C;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308A;&#x3001;&#x653F;&#x5E9C;&#x304C;&#x904B;&#x55B6;&#x6BCD;&#x4F53;&#x3068;&#x306A;&#x308A;&#x7A0E;&#x53CE;&#x3092;&#x78BA;&#x4FDD;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x3059;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<h1 id="&#x5B9D;&#x304F;&#x3058;&#x304C;&#x306A;&#x305C;&#x6CD5;&#x5F8B;&#x3067;&#x7981;&#x6B62;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x306E;&#x304B;&#xFF1F;">&#x5B9D;&#x304F;&#x3058;&#x304C;&#x306A;&#x305C;&#x6CD5;&#x5F8B;&#x3067;&#x7981;&#x6B62;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x306E;&#x304B;&#xFF1F;</h1>
<p>&#x6C11;&#x9593;&#x3067;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x3059;&#x308B;&#x3068;&#x4E0D;&#x6B63;&#x304C;&#x8D77;&#x304D;&#x308B;&#x305F;&#x3081;&#x3067;&#x3059;&#x3002;</p>
<p>&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x6280;&#x8853;&#x3092;&#x4F7F;&#x3048;&#x3070;&#x3001;&#x516B;&#x767E;&#x9577;&#x306F;&#x8D77;&#x304D;&#x306A;&#x3044;&#x306E;&#x3067;&#x3001;&#x9577;&#x671F;&#x7684;&#x306B;&#x306F;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x306F;&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x3092;&#x4F7F;&#x3048;&#x3070;&#x6C11;&#x9593;&#x4F01;&#x696D;&#x304C;&#x884C;&#x3063;&#x3066;&#x3082;&#x3088;&#x3044;&#x65B9;&#x5411;&#x306B;&#x5411;&#x304B;&#x3046;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<h1 id="&#x5B9D;&#x304F;&#x3058;&#x306E;&#x4E0D;&#x6B63;&#x306E;&#x4E8B;&#x4F8B;">&#x5B9D;&#x304F;&#x3058;&#x306E;&#x4E0D;&#x6B63;&#x306E;&#x4E8B;&#x4F8B;</h1>
<p>&#x30BB;&#x30EB;&#x30D3;&#x30A2;&#x306E;&#x56FD;&#x55B6;&#x5B9D;&#x304F;&#x3058;&#x4F1A;&#x793E;&#x304C;&#x4E0D;&#x6B63;</p>
<p><a href="https://www.independent.co.uk/news/world/europe/serbian-lottery-probe-after-winning-number-called-before-its-drawn-10430922.html" target="_blank">https://www.independent.co.uk/news/world/europe/serbian-lottery-probe-after-winning-number-called-before-its-drawn-10430922.html</a></p>
<p>&#x4E2D;&#x56FD;&#x3067;&#x516C;&#x55B6;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x53CE;&#x76CA;&#x304C;&#x4E0D;&#x6B63;&#x306B;&#x6D41;&#x7528;&#x3055;&#x308C;&#x308B;</p>
<p><a href="https://www.nikkei.com/article/DGKKASGM08H2T_Z20C15A7EAF000/" target="_blank">https://www.nikkei.com/article/DGKKASGM08H2T_Z20C15A7EAF000/</a></p>
<p>&#x5B9D;&#x304F;&#x3058;&#x904B;&#x55B6;&#x4F1A;&#x793E;&#x306E;&#x8077;&#x54E1;&#x304C;&#x4E0D;&#x6B63;</p>
<p><a href="https://www.desmoinesregister.com/story/news/investigations/2017/08/22/iowa-lottery-cheat-sentenced-25-years/566642001/" target="_blank">https://www.desmoinesregister.com/story/news/investigations/2017/08/22/iowa-lottery-cheat-sentenced-25-years/566642001/</a></p>
<h1 id="web3&#x5B9D;&#x304F;&#x3058;&#x53C2;&#x52A0;&#x8005;&#x306E;&#x4F7F;&#x3044;&#x65B9;">web3&#x5B9D;&#x304F;&#x3058;&#x53C2;&#x52A0;&#x8005;&#x306E;&#x4F7F;&#x3044;&#x65B9;</h1>
<p>&#x53D6;&#x5F15;&#x6240;&#x3084;DeFi&#x3067;ERC20&#x30C8;&#x30FC;&#x30AF;&#x30F3;&#x3092;&#x5165;&#x624B;&#x3059;&#x308B;&#x3002;</p>
<p>&#x5B9D;&#x304F;&#x3058;&#x306E;&#x30B5;&#x30A4;&#x30C8;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3057;&#x3066;&#x3001;metamask&#x306A;&#x3069;&#x306E;&#x30A6;&#x30A9;&#x30EC;&#x30C3;&#x30C8;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3067;&#x30ED;&#x30B0;&#x30A4;&#x30F3;&#x3057;&#x3066;&#x3001;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x8CFC;&#x5165;&#x3059;&#x308B;&#x3002;</p>
<p>&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x8CFC;&#x5165;&#x3057;&#x305F;&#x3089;&#x3001;&#x3069;&#x308C;&#x304F;&#x3089;&#x3044;&#x306E;&#x78BA;&#x7387;&#x3067;&#x3001;&#x5F53;&#x305B;&#x3093;&#x3059;&#x308B;&#x306E;&#x304B;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</p>
<p>&#x5F53;&#x305B;&#x3093;&#x65E5;&#x306B;&#x306A;&#x3063;&#x305F;&#x3089;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x3067;&#x5F53;&#x305B;&#x3093;&#x8005;&#x304C;&#x9078;&#x3070;&#x308C;&#x3066;&#x3001;&#x5F53;&#x305B;&#x3093;&#x8005;&#x306B;&#x81EA;&#x52D5;&#x3067;&#x9001;&#x91D1;&#x304C;&#x884C;&#x308F;&#x308C;&#x307E;&#x3059;&#x3002;</p>
<p>&#x6295;&#x7968;&#x306B;&#x3088;&#x3063;&#x3066;&#x6C7A;&#x307E;&#x3063;&#x305F;&#x30C1;&#x30E3;&#x30EA;&#x30C6;&#x30A3;&#x6D3B;&#x52D5;&#x3092;&#x4F7F;&#x3046;&#x56E3;&#x4F53;&#x306B;&#x9001;&#x91D1;&#x304C;&#x884C;&#x308F;&#x308C;&#x307E;&#x3059;&#x3002;</p>
<h1 id="&#x5E02;&#x5834;&#x898F;&#x6A21;">&#x5E02;&#x5834;&#x898F;&#x6A21;</h1>
<h2 id="&#x5B9D;&#x304F;&#x3058;">&#x5B9D;&#x304F;&#x3058;</h2>
<p>&#x65E5;&#x672C;: 7,866&#x5104;&#x5186; 2018&#x5E74;&#x5EA6;</p>
<p>&#x5F15;&#x7528;&#x5143;: <a href="https://www.soumu.go.jp/main_content/000583736.pdf" target="_blank">https://www.soumu.go.jp/main_content/000583736.pdf</a></p>
<p>&#x4E16;&#x754C;: 2000&#x5104;&#x30C9;&#x30EB;</p>
<p>&#x4E16;&#x754C;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x5E02;&#x5834;&#x898F;&#x6A21;&#x306F;2020&#x5E74;&#x304B;&#x3089;2025&#x5E74;&#x307E;&#x3067;&#x3001;194.14&#x5104;&#x7C73;&#x30C9;&#x30EB;&#x5897;&#x52A0;&#x3059;&#x308B;&#x3002;</p>
<p>&#x5F15;&#x7528;&#x5143;: <a href="https://www.prnewswire.com/news-releases/lottery-market-size-to-grow-by-usd-194-14-bn--38-of-the-growth-from-apac--17-000-technavio-reports-301501174.html" target="_blank">https://www.prnewswire.com/news-releases/lottery-market-size-to-grow-by-usd-194-14-bn--38-of-the-growth-from-apac--17-000-technavio-reports-301501174.html</a></p>
<h2 id="&#x4EEE;&#x60F3;&#x901A;&#x8CA8;">&#x4EEE;&#x60F3;&#x901A;&#x8CA8;</h2>
<p>&#x6642;&#x4FA1;&#x7DCF;&#x984D;&#x30C8;&#x30C3;&#x30D7;5&#x3092;&#x8DB3;&#x3057;&#x305F;&#x3060;&#x3051;&#x3067;&#x3001;100&#x5146;&#x5186;&#x3092;&#x8D85;&#x3048;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
&#x4ECA;&#x5F8C;&#x3082;&#x6210;&#x9577;&#x3059;&#x308B;&#x898B;&#x8FBC;&#x307F;&#x3067;&#x3059;&#x3002;</p>
<h1 id="&#x6280;&#x8853;&#x4ED5;&#x69D8;&#x306B;&#x3064;&#x3044;&#x3066;">&#x6280;&#x8853;&#x4ED5;&#x69D8;&#x306B;&#x3064;&#x3044;&#x3066;</h1>
<h2 id="&#x4F7F;&#x7528;&#x30C4;&#x30FC;&#x30EB;">&#x4F7F;&#x7528;&#x30C4;&#x30FC;&#x30EB;</h2>
<p>Solidity</p>
<p>Hardhat</p>
<p>Alchemy/Infura</p>
<p>React/Next.js</p>
<h2 id="&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;">&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;</h2>
<p>Solidity&#x3067;&#x958B;&#x767A;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3001;Ethereum&#x3001;Binance&#x3001;Polygon, Avalanche&#x306A;&#x3069;&#x3067;&#x4F7F;&#x7528;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;</p>
<h2 id="&#x5F53;&#x305B;&#x3093;&#x306E;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x6027;&#x3092;&#x62C5;&#x4FDD;&#x3059;&#x308B;&#x4ED5;&#x7D44;&#x307F;">&#x5F53;&#x305B;&#x3093;&#x306E;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x6027;&#x3092;&#x62C5;&#x4FDD;&#x3059;&#x308B;&#x4ED5;&#x7D44;&#x307F;</h2>
<p>Chainlink VRF&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3068;&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x4E0A;&#x3067;&#x691C;&#x8A3C;&#x53EF;&#x80FD;&#x306A;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x306A;&#x6570;&#x5B57;&#x3092;&#x53D6;&#x5F97;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p><a href="https://docs.chain.link/docs/chainlink-vrf/" target="_blank">https://docs.chain.link/docs/chainlink-vrf/</a></p>
<p>Chainlink VRF&#x306F;PancakeSwap&#x3084;PoolTogether&#x306A;&#x3069;&#x306E;&#x5229;&#x7528;&#x5B9F;&#x7E3E;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<h3 id="pancakeswap">PancakeSwap</h3>
<p>&#x30D0;&#x30A4;&#x30CA;&#x30F3;&#x30B9;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x4E0A;&#x306E;DeFi&#x304C;&#x904B;&#x55B6;&#x3057;&#x3066;&#x3044;&#x308B;&#x5B9D;&#x304F;&#x3058;</p>
<p><a href="https://pancakeswap.finance/lottery" target="_blank">https://pancakeswap.finance/lottery</a></p>
<h3 id="pooltogether">PoolTogether</h3>
<p>&#x640D;&#x5931;&#x306E;&#x51FA;&#x306A;&#x3044;&#x5B9D;&#x304F;&#x3058;&#x3001;DeFi&#x30D7;&#x30FC;&#x30EB;&#x3057;&#x3066;&#x5F97;&#x305F;&#x5229;&#x76CA;&#x3092;&#x30D7;&#x30FC;&#x30EB;&#x3057;&#x305F;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306B;&#x62BD;&#x9078;&#x3067;&#x5206;&#x914D;&#x3059;&#x308B;</p>
<p><a href="https://PoolTogether.com/" target="_blank">https://PoolTogether.com/</a></p>
<h1 id="web3lottery-&#x30A2;&#x30FC;&#x30AD;&#x30C6;&#x30AF;&#x30C1;&#x30E3;">Web3Lottery &#x30A2;&#x30FC;&#x30AD;&#x30C6;&#x30AF;&#x30C1;&#x30E3;</h1>
<p><img src="img/architecture.png" alt=""></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="en.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: English">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"日本語","level":"1.2.2","depth":2,"previous":{"title":"English","level":"1.2.1","depth":2,"path":"en.md","ref":"en.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-sharing","hide-published-with","intopic-toc"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"hide-published-with":{},"intopic-toc":{"isCollapsed":true,"isScrollspyActive":true,"label":"In this article","maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Foxlottery Whitepaper","gitbook":"*","description":"Foxlottery is a fully decentralized lottery using crypto assets and smart contracts."},"file":{"path":"ja.md","mtime":"2022-06-07T08:34:10.138Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-06-15T16:18:12.895Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-hide-published-with/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

