
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>日本語 · Foxlottery Whitepaper</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="en.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" >
            
                <a target="_blank" href="https://www.foxlottery.org">
            
                    
                    Foxlottery
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    Whitepaper
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="en.html">
            
                <a href="en.html">
            
                    
                    English
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="ja.html">
            
                <a href="ja.html">
            
                    
                    日本語
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >日本語</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="foxlottery">Foxlottery</h1>
<p><img src="img/header-logs.png" alt=""></p>
<h1 id="&#x6982;&#x8981;">&#x6982;&#x8981;</h1>
<p>FoxLottery&#x306F;&#x6697;&#x53F7;&#x8CC7;&#x7523;&#x3068;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30B3;&#x30F3;&#x30C8;&#x30E9;&#x30AF;&#x30C8;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x305F;&#x5B8C;&#x5168;&#x306B;&#x5206;&#x6563;&#x5316;&#x3055;&#x308C;&#x305F;&#x5B9D;&#x304F;&#x3058;&#x3067;&#x3059;&#x3002;
&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304B;&#x3089;&#x53CE;&#x96C6;&#x3057;&#x305F;ERC20&#x30C8;&#x30FC;&#x30AF;&#x30F3;&#x3092;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x306A;&#x5F53;&#x9078;&#x8005;&#x306B;&#x5206;&#x914D;&#x3057;&#x307E;&#x3059;&#x3002;
FoxLottery Token&#x3092;&#x30B9;&#x30C6;&#x30FC;&#x30AD;&#x30F3;&#x30B0;&#x3059;&#x308B;&#x3068;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x53CE;&#x76CA;&#x306E;&#x4E00;&#x90E8;&#x3092;&#x3082;&#x3089;&#x3048;&#x308B;&#x6A29;&#x5229;&#x3068;&#x30C1;&#x30E3;&#x30EA;&#x30C6;&#x30A3;&#x6D3B;&#x52D5;&#x8CBB;&#x306E;&#x4F7F;&#x3044;&#x9053;&#x306E;&#x6295;&#x7968;&#x6A29;&#x3092;&#x5F97;&#x307E;&#x3059;&#x3002;
&#x30B9;&#x30C6;&#x30FC;&#x30AD;&#x30F3;&#x30B0;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306E;&#x6295;&#x7968;&#x306B;&#x3088;&#x3063;&#x3066;&#x30C1;&#x30E3;&#x30EA;&#x30C6;&#x30A3;&#x30FC;&#x6D3B;&#x52D5;&#x306E;&#x4F7F;&#x3044;&#x9053;&#x3092;&#x6C7A;&#x5B9A;&#x3057;&#x3001;&#x30C1;&#x30E3;&#x30EA;&#x30C6;&#x30A3;&#x56E3;&#x4F53;&#x306E;&#x30A6;&#x30A9;&#x30EC;&#x30C3;&#x30C8;&#x306B;&#x9001;&#x91D1;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x3067;&#x306F;&#x3001;&#x9084;&#x5143;&#x7387;&#x304C;50%&#x307B;&#x3069;&#x3067;&#x3059;&#x304C;&#x3001;
Foxlottery&#x3067;&#x306F;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x3078;&#x306E;&#x9084;&#x5143;&#x7387;&#x3092;75%&#x306B;&#x3057;&#x3066;&#x3001;&#x30A2;&#x30D5;&#x30A3;&#x30EA;&#x30A8;&#x30A4;&#x30C8;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306B;5&#xFF05;&#x3001;&#x6B8B;&#x308A;15%&#x3092;&#x53CE;&#x76CA;&#x3001;&#x975E;&#x55B6;&#x5229;&#x6D3B;&#x52D5;&#x8CBB;&#x3092;5%&#x306B;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p>&#x5B9D;&#x304F;&#x3058;&#x306E;&#x53CE;&#x76CA;&#x306F;&#x4E0B;&#x8A18;&#x306B;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<ul>
<li>DeFi&#x3067;&#x904B;&#x7528;</li>
<li>PR&#x6D3B;&#x52D5;</li>
<li>&#x958B;&#x767A;&#x8CC7;&#x91D1;</li>
<li>&#x30A8;&#x30B3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306E;&#x69CB;&#x7BC9;</li>
<li>&#x30B9;&#x30C6;&#x30FC;&#x30AD;&#x30F3;&#x30B0;&#x30A6;&#x30A9;&#x30EC;&#x30C3;&#x30C8;&#x3078;&#x306E;&#x914D;&#x5F53;</li>
</ul>
<p>Foxlottery&#x306E;&#x7D44;&#x7E54;&#x306F;&#x5B8C;&#x5168;&#x306B;DAO(&#x81EA;&#x7ACB;&#x5206;&#x6563;&#x578B;&#x7D44;&#x7E54;)&#x5316;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x76EE;&#x6307;&#x3057;&#x3066;&#x6D3B;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<h1 id="&#x30D3;&#x30B8;&#x30E7;&#x30F3;">&#x30D3;&#x30B8;&#x30E7;&#x30F3;</h1>
<p>&#x5206;&#x6563;&#x578B;&#x5B9D;&#x304F;&#x3058;&#x3067;&#x793E;&#x4F1A;&#x3092;&#x3088;&#x308A;&#x826F;&#x304F;&#x3059;&#x308B;</p>
<h1 id="&#x4E2D;&#x592E;&#x96C6;&#x6A29;&#x7684;&#x306A;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x8AB2;&#x984C;">&#x4E2D;&#x592E;&#x96C6;&#x6A29;&#x7684;&#x306A;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x8AB2;&#x984C;</h1>
<ul>
<li>&#x900F;&#x660E;&#x6027;&#x304C;&#x306A;&#x3044;&#x3002;</li>
<li>&#x5206;&#x914D;&#x7387;&#x304C;&#x4F4E;&#x3044;&#x3002;</li>
<li>&#x5229;&#x76CA;&#x306E;&#x4E00;&#x90E8;&#x3092;&#x30C1;&#x30E3;&#x30EA;&#x30C6;&#x30A3;&#x306B;&#x4F7F;&#x308F;&#x308C;&#x3066;&#x3044;&#x308B;&#x304C;&#x3001;&#x3069;&#x3053;&#x306B;&#x5BC4;&#x4ED8;&#x3059;&#x308B;&#x304B;&#x306F;&#x4E2D;&#x592E;&#x96C6;&#x6A29;&#x7684;&#x306B;&#x6C7A;&#x3081;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;</li>
<li>&#x8CA9;&#x58F2;&#x4FC3;&#x9032;&#x306B;&#x304B;&#x3051;&#x308B;&#x91D1;&#x984D;&#x304C;&#x591A;&#x3044;&#x3002;</li>
<li>&#x7D19;&#x304F;&#x3058;&#x306F;&#x74B0;&#x5883;&#x306B;&#x826F;&#x304F;&#x306A;&#x3044;&#x3002;</li>
<li>&#x5F53;&#x9078;&#x3057;&#x305F;&#x3089;&#x9280;&#x884C;&#x306B;&#x53D6;&#x308A;&#x306B;&#x884C;&#x304F;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;</li>
</ul>
<h1 id="&#x8AB2;&#x984C;&#x3092;&#x89E3;&#x6C7A;&#x3059;&#x308B;&#x30BD;&#x30EA;&#x30E5;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30FB;&#x6A5F;&#x80FD;">&#x8AB2;&#x984C;&#x3092;&#x89E3;&#x6C7A;&#x3059;&#x308B;&#x30BD;&#x30EA;&#x30E5;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30FB;&#x6A5F;&#x80FD;</h1>
<ul>
<li>&#x900F;&#x660E;&#x6027;&#x306E;&#x3042;&#x308B;&#x5F53;&#x9078;&#x8005;&#x6C7A;&#x5B9A;</li>
<li>&#x9AD8;&#x3044;&#x5206;&#x914D;&#x7387;</li>
<li>&#x30A2;&#x30D5;&#x30A3;&#x30EA;&#x30A8;&#x30A4;&#x30C8;&#x3067;&#x8CA9;&#x58F2;&#x4FC3;&#x9032;&#x30B3;&#x30B9;&#x30C8;&#x306E;&#x524A;&#x6E1B;</li>
<li>&#x5B9D;&#x304F;&#x3058;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x8CFC;&#x5165;&#x3059;&#x308B;&#x6642;&#x306B;&#x53CE;&#x76CA;&#x306E;&#x5BC4;&#x4ED8;&#x5148;&#x3092;&#x6295;&#x7968;&#x3059;&#x308B;</li>
<li>DAO&#x5316;</li>
<li>&#x5F53;&#x9078;&#x3057;&#x305F;&#x3089;&#x81EA;&#x52D5;&#x3067;&#x30A6;&#x30A9;&#x30EC;&#x30C3;&#x30C8;&#x306B;&#x9001;&#x91D1;&#x3055;&#x308C;&#x308B;</li>
</ul>
<h2 id="&#x900F;&#x660E;&#x6027;&#x306E;&#x3042;&#x308B;&#x5F53;&#x9078;&#x8005;&#x6C7A;&#x5B9A;">&#x900F;&#x660E;&#x6027;&#x306E;&#x3042;&#x308B;&#x5F53;&#x9078;&#x8005;&#x6C7A;&#x5B9A;</h2>
<p>&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x4E0A;&#x3067;&#x4E71;&#x6570;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x306E;&#x3067;&#x3001;&#x900F;&#x660E;&#x6027;&#x306E;&#x3042;&#x308B;&#x5F53;&#x9078;&#x8005;&#x6C7A;&#x5B9A;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;</p>
<h2 id="&#x9AD8;&#x3044;&#x5206;&#x914D;&#x7387;">&#x9AD8;&#x3044;&#x5206;&#x914D;&#x7387;</h2>
<p>&#x5206;&#x6563;&#x578B;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x30E1;&#x30EA;&#x30C3;&#x30C8;</p>
<ul>
<li>&#x904B;&#x55B6;&#x8CBB;&#x304C;&#x5C11;&#x306A;&#x3044;</li>
<li>&#x30A2;&#x30D5;&#x30A3;&#x30EA;&#x30A8;&#x30A4;&#x30C8;&#x6A5F;&#x80FD;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x3067;&#x8CA9;&#x4FC3;&#x8CBB;&#x7528;&#x3092;&#x6291;&#x3048;&#x3066;&#x3044;&#x308B;</li>
<li>&#x5F53;&#x9078;&#x91D1;&#x304C;&#x591A;&#x3044;</li>
<li>&#x30C1;&#x30E3;&#x30EA;&#x30C6;&#x30A3;&#x6D3B;&#x52D5;&#x8CBB;&#x304C;&#x591A;&#x3044;&#x3001;&#x5229;&#x7528;&#x5148;&#x306F;&#x6295;&#x7968;&#x306B;&#x3088;&#x3063;&#x3066;&#x6C7A;&#x307E;&#x308B;&#x3002;</li>
</ul>
<p><img src="img/ja/distributed_lottery_distribution_rates.png" alt=""></p>
<p>&#x4E2D;&#x592E;&#x96C6;&#x6A29;&#x7684;&#x306A;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x30C7;&#x30E1;&#x30EA;&#x30C3;&#x30C8;</p>
<ul>
<li>&#x672C;&#x90E8;&#x306E;&#x53CE;&#x76CA;&#x306E;&#x6BD4;&#x7387;&#x304C;&#x9AD8;&#x3044;&#x3002;</li>
<li>&#x7D19;&#x3067;&#x5370;&#x5237;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x5370;&#x5237;&#x8CBB;&#x7528;&#x3082;&#x304B;&#x304B;&#x308A;&#x3001;&#x74B0;&#x5883;&#x306B;&#x60AA;&#x3044;&#x3002;</li>
<li>&#x793E;&#x4F1A;&#x8CA2;&#x732E;&#x5E83;&#x5831;&#x8CBB;&#x304C;&#x5C11;&#x306A;&#x304F;&#x3001;&#x5229;&#x7528;&#x5148;&#x306F;&#x4E2D;&#x592E;&#x96C6;&#x6A29;&#x7684;&#x306B;&#x6C7A;&#x3081;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;</li>
<li>&#x5F53;&#x9078;&#x91D1;&#x306E;&#x91D1;&#x984D;&#x304C;&#x5C11;&#x306A;&#x3044;&#x3002;</li>
</ul>
<p>&#x203B; &#x3053;&#x3061;&#x3089;&#x306F;&#x65E5;&#x672C;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x4F8B;&#x306B;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p><img src="img/ja/centralized_lottery_distribution_rates.png" alt=""></p>
<h2 id="&#x30A2;&#x30D5;&#x30A3;&#x30EA;&#x30A8;&#x30A4;&#x30C8;&#x3067;&#x8CA9;&#x58F2;&#x4FC3;&#x9032;&#x30B3;&#x30B9;&#x30C8;&#x306E;&#x524A;&#x6E1B;">&#x30A2;&#x30D5;&#x30A3;&#x30EA;&#x30A8;&#x30A4;&#x30C8;&#x3067;&#x8CA9;&#x58F2;&#x4FC3;&#x9032;&#x30B3;&#x30B9;&#x30C8;&#x306E;&#x524A;&#x6E1B;</h2>
<p>&#x30A2;&#x30D5;&#x30A3;&#x30EA;&#x30A8;&#x30A4;&#x30BF;&#x30FC;&#x306F;Foxlottery&#x3092;&#x7D39;&#x4ECB;&#x3057;&#x3066;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304C;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x8CB7;&#x3046;&#x3053;&#x3068;&#x3067;&#x3001;&#x8CA9;&#x58F2;&#x624B;&#x6570;&#x6599;&#x3092;&#x3082;&#x3089;&#x3048;&#x307E;&#x3059;&#x3002;</p>
<p>&#x30A2;&#x30D5;&#x30A3;&#x30EA;&#x30A8;&#x30A4;&#x30C8;&#x306B;&#x53C2;&#x52A0;&#x3059;&#x308B;&#x306B;&#x306F;&#x4E00;&#x5B9A;&#x306E;&#x4EE5;&#x4E0A;&#x306E;Foxlottery&#x306E;ERC20&#x30C8;&#x30FC;&#x30AF;&#x30F3;&#x3092;&#x30B9;&#x30C6;&#x30FC;&#x30AD;&#x30F3;&#x30B0;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;
&#x5B9D;&#x304F;&#x3058;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x8CFC;&#x5165;&#x3057;&#x305F;&#x91D1;&#x984D;&#x306E;5%&#x3092;&#x30A2;&#x30D5;&#x30A3;&#x30EA;&#x30A8;&#x30A4;&#x30C8;&#x624B;&#x6570;&#x6599;&#x3068;&#x3057;&#x3066;&#x3001;&#x30A2;&#x30D5;&#x30A3;&#x30EA;&#x30A8;&#x30A4;&#x30BF;&#x30FC;&#x306B;&#x652F;&#x6255;&#x3046;&#x3002;&#x30A2;&#x30D5;&#x30A3;&#x30EA;&#x30A8;&#x30A4;&#x30BF;&#x30FC;&#x7D4C;&#x7531;&#x3067;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;&#x305D;&#x306E;&#x8CC7;&#x91D1;&#x306F;Foxlottery&#x904B;&#x55B6;&#x306B;&#x652F;&#x6255;&#x308F;&#x308C;&#x308B;&#x3002;
&#x306A;&#x306E;&#x3067;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x53C2;&#x52A0;&#x8005;&#x306F;&#x30A2;&#x30D5;&#x30A3;&#x30EA;&#x30A8;&#x30A4;&#x30BF;&#x30FC;&#x7D4C;&#x7531;&#x3067;&#x3082;&#x3001;&#x76F4;&#x63A5;Foxlottery&#x904B;&#x55B6;&#x306E;&#x30B5;&#x30A4;&#x30C8;&#x304B;&#x3089;&#x53C2;&#x52A0;&#x3057;&#x3066;&#x3082;&#x3001;&#x652F;&#x6255;&#x3046;&#x91D1;&#x984D;&#x306F;&#x540C;&#x3058;&#x306B;&#x306A;&#x308B;&#x3002;</p>
<h2 id="&#x5B9D;&#x304F;&#x3058;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x8CFC;&#x5165;&#x3059;&#x308B;&#x6642;&#x306B;&#x53CE;&#x76CA;&#x306E;&#x5BC4;&#x4ED8;&#x5148;&#x3092;&#x6295;&#x7968;&#x3059;&#x308B;">&#x5B9D;&#x304F;&#x3058;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x8CFC;&#x5165;&#x3059;&#x308B;&#x6642;&#x306B;&#x53CE;&#x76CA;&#x306E;&#x5BC4;&#x4ED8;&#x5148;&#x3092;&#x6295;&#x7968;&#x3059;&#x308B;</h2>
<p>&#x5B9D;&#x304F;&#x3058;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x8CFC;&#x5165;&#x3059;&#x308B;&#x6642;&#x306B;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306F;&#x9054;&#x6210;&#x3057;&#x305F;&#x3044;SDGs&#x306E;&#x76EE;&#x6A19;&#x3092;&#x9078;&#x629E;
&#x76EE;&#x6A19;&#x3054;&#x3068;&#x306B;&#x305D;&#x306E;&#x5206;&#x91CE;&#x3067;&#x6D3B;&#x52D5;&#x3057;&#x3066;&#x3044;&#x308B;&#x56E3;&#x4F53;&#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><img src="img/ja/SDGs.png" alt=""></p>
<p>&#x5B9D;&#x304F;&#x3058;&#x304C;&#x7D42;&#x4E86;&#x5F8C;&#x3001;&#x6295;&#x7968;&#x306B;&#x3088;&#x3063;&#x3066;&#x6C7A;&#x3081;&#x3089;&#x308C;&#x305F;&#x56E3;&#x4F53;&#x306B;&#x53CE;&#x76CA;&#x306E;&#x4E00;&#x90E8;&#x3092;&#x5373;&#x6642;&#x306B;&#x9001;&#x91D1;&#x3092;&#x3057;&#x307E;&#x3059;&#x3002;
&#x3053;&#x306E;&#x30B9;&#x30D4;&#x30FC;&#x30C9;&#x611F;&#x306E;&#x3042;&#x308B;&#x6148;&#x5584;&#x4E8B;&#x696D;&#x3078;&#x306E;&#x53D6;&#x308A;&#x7D44;&#x307F;&#x306F;&#x3001;&#x793E;&#x4F1A;&#x3092;&#x3088;&#x308A;&#x5E73;&#x548C;&#x3067;&#x8C4A;&#x304B;&#x306A;&#x3082;&#x306E;&#x306B;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p>&#x6148;&#x5584;&#x56E3;&#x4F53;&#x306F;Foxlottery&#x306B;&#x7533;&#x8ACB;&#x3059;&#x308B;&#x3068;&#x3001;&#x30D7;&#x30ED;&#x30D5;&#x30A3;&#x30FC;&#x30EB;&#x3068;&#x30A6;&#x30A9;&#x30EC;&#x30C3;&#x30C8;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x3092;&#x5BC4;&#x4ED8;&#x5148;&#x30EA;&#x30B9;&#x30C8;&#x306B;&#x8F09;&#x305B;&#x3089;&#x308C;&#x307E;&#x3059;&#x3002;</p>
<h2 id="dao&#x5316;">DAO&#x5316;</h2>
<p>&#x30AC;&#x30D0;&#x30CA;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30AF;&#x30F3;&#x3092;&#x6301;&#x3063;&#x3066;&#x3044;&#x308B;&#x4EBA;&#x304C;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x65B9;&#x91DD;&#x3092;&#x6C7A;&#x3081;&#x308B;&#x3002;
&#x30DE;&#x30FC;&#x30B1;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x6D3B;&#x52D5;&#x3084;&#x958B;&#x767A;&#x3092;&#x30AA;&#x30FC;&#x30CA;&#x30FC;&#x7D44;&#x7E54;&#x304C;&#x884C;&#x3046;&#x3002;
&#x30B9;&#x30C6;&#x30FC;&#x30AD;&#x30F3;&#x30B0;&#x3059;&#x308B;&#x3068;&#x53CE;&#x76CA;&#x306E;&#x4E00;&#x90E8;&#x304C;&#x8CB0;&#x3048;&#x308B;&#x3002;</p>
<h2 id="&#x5F53;&#x9078;&#x3057;&#x305F;&#x3089;&#x81EA;&#x52D5;&#x3067;&#x30A6;&#x30A9;&#x30EC;&#x30C3;&#x30C8;&#x306B;&#x9001;&#x91D1;&#x3055;&#x308C;&#x308B;">&#x5F53;&#x9078;&#x3057;&#x305F;&#x3089;&#x81EA;&#x52D5;&#x3067;&#x30A6;&#x30A9;&#x30EC;&#x30C3;&#x30C8;&#x306B;&#x9001;&#x91D1;&#x3055;&#x308C;&#x308B;</h2>
<p>&#x65E5;&#x672C;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x306F;&#x9AD8;&#x984D;&#x5F53;&#x9078;&#x306E;&#x5834;&#x5408;&#x3001;&#x5E73;&#x65E5;&#x306E;&#x663C;&#x306B;&#x9280;&#x884C;&#x306B;&#x8EAB;&#x5206;&#x8A3C;&#x660E;&#x66F8;&#x3092;&#x6301;&#x53C2;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;
&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x3092;&#x4F7F;&#x3048;&#x3070;&#x3001;&#x5F53;&#x9078;&#x3057;&#x305F;&#x3089;&#x81EA;&#x52D5;&#x3067;&#x30A6;&#x30A9;&#x30EC;&#x30C3;&#x30C8;&#x306B;&#x9001;&#x91D1;&#x3055;&#x308C;&#x3066;&#x3001;&#x305D;&#x306E;&#x65E5;&#x306B;&#x4F7F;&#x3048;&#x308B;&#x3002;</p>
<p>&#x6D77;&#x5916;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x4E2D;&#x306B;&#x306F;&#x3001;&#x5F53;&#x9078;&#x65E5;&#x306E;7&#x65E5;&#x4EE5;&#x5185;&#x306B;&#x53D6;&#x308A;&#x306B;&#x884C;&#x304B;&#x306A;&#x3044;&#x3068;&#x3001;&#x5931;&#x52B9;&#x3055;&#x308C;&#x3066;&#x3057;&#x307E;&#x3046;&#x5B9D;&#x304F;&#x3058;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;
&#x81EA;&#x52D5;&#x9001;&#x91D1;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x3082;&#x3089;&#x3044;&#x5FD8;&#x308C;&#x304C;&#x306A;&#x304F;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<h1 id="&#x30A8;&#x30B3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;">&#x30A8;&#x30B3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;</h1>
<p>&#x3053;&#x306E;&#x30A8;&#x30B3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x56DE;&#x3057;&#x3066;&#x3044;&#x304F;
&#x30C1;&#x30E3;&#x30EA;&#x30C6;&#x30A3;&#x6D3B;&#x52D5;, DeFi, &#x5B9D;&#x304F;&#x3058;, &#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x3078;&#x306E;&#x8CA2;&#x732E;</p>
<p><img src="img/ecosystem.png" alt=""></p>
<h2 id="&#x5B9D;&#x304F;&#x3058;&#x3067;&#x304B;&#x3051;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x8CC7;&#x91D1;&#x3092;&#x4F7F;&#x3063;&#x3066;defi&#x3067;&#x904B;&#x7528;">&#x5B9D;&#x304F;&#x3058;&#x3067;&#x304B;&#x3051;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x8CC7;&#x91D1;&#x3092;&#x4F7F;&#x3063;&#x3066;DeFi&#x3067;&#x904B;&#x7528;</h2>
<p>&#x9031;&#x9593;&#x5B9D;&#x304F;&#x3058;&#x3067;&#x3001;&#x9031;&#x306E;&#x521D;&#x65E5;&#x306B;&#x5B9D;&#x304F;&#x3058;&#x306B;&#x9810;&#x3051;&#x3089;&#x305F;&#x5834;&#x5408;&#x3001;&#x5F53;&#x305F;&#x308B;&#x78BA;&#x7387;&#x304C;&#x5C11;&#x3057;&#x9AD8;&#x304F;&#x306A;&#x308B;&#x3088;&#x3046;&#x306B;&#x8A2D;&#x5B9A;&#x3057;&#x3066;&#x3002;&#x591A;&#x304F;&#x306E;&#x8CC7;&#x91D1;&#x3092;&#x9031;&#x306E;&#x521D;&#x65E5;&#x306B;&#x96C6;&#x307E;&#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x307E;&#x3059;&#x3002;
&#x96C6;&#x307E;&#x3063;&#x305F;ERC20&#x30C8;&#x30FC;&#x30AF;&#x30F3;&#x306F;uniswap&#x306A;&#x3069;&#x3067;&#x904B;&#x7528;&#x3057;&#x3066;&#x53CE;&#x76CA;&#x3092;&#x51FA;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<h1 id="&#x5B9D;&#x304F;&#x3058;&#x53C2;&#x52A0;&#x8005;&#x306E;&#x4F7F;&#x3044;&#x65B9;">&#x5B9D;&#x304F;&#x3058;&#x53C2;&#x52A0;&#x8005;&#x306E;&#x4F7F;&#x3044;&#x65B9;</h1>
<p>&#x53D6;&#x5F15;&#x6240;&#x3084;DeFi&#x3067;Foxlottery&#x30C8;&#x30FC;&#x30AF;&#x30F3;&#x3092;&#x8CFC;&#x5165;&#x3057;&#x3066;&#x3001;
&#x65E5;&#x9593;&#x3001;&#x9031;&#x9593;&#x3001;&#x6708;&#x9593;&#x3001;&#x5E74;&#x9593;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30B3;&#x30F3;&#x30C8;&#x30E9;&#x30AF;&#x30C8;&#x304C;&#x3042;&#x308B;&#x306E;&#x3067;&#x3001;&#x597D;&#x304D;&#x306A;&#x3082;&#x306E;&#x306B;&#x8CC7;&#x91D1;&#x3092;&#x9810;&#x3051;&#x307E;&#x3059;&#x3002;
&#x30C1;&#x30E3;&#x30EA;&#x30C6;&#x30A3;&#x6D3B;&#x52D5;&#x306E;&#x4F7F;&#x3044;&#x9053;&#x3092;&#x6295;&#x7968;&#x3057;&#x307E;&#x3059;&#x3002;
&#x8CC7;&#x91D1;&#x3092;&#x9810;&#x3051;&#x305F;&#x3089;&#x3001;&#x3069;&#x308C;&#x304F;&#x3089;&#x3044;&#x306E;&#x78BA;&#x7387;&#x3067;&#x3001;&#x5F53;&#x9078;&#x3059;&#x308B;&#x306E;&#x304B;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;
&#x5F53;&#x9078;&#x65E5;&#x306B;&#x306A;&#x3063;&#x305F;&#x3089;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x3067;&#x5F53;&#x9078;&#x8005;&#x304C;&#x9078;&#x3070;&#x308C;&#x3066;&#x3001;&#x5F53;&#x9078;&#x8005;&#x306B;&#x81EA;&#x52D5;&#x3067;&#x9001;&#x91D1;&#x304C;&#x884C;&#x308F;&#x308C;&#x307E;&#x3059;&#x3002;
&#x6295;&#x7968;&#x306B;&#x3088;&#x3063;&#x3066;&#x6C7A;&#x307E;&#x3063;&#x305F;&#x30C1;&#x30E3;&#x30EA;&#x30C6;&#x30A3;&#x6D3B;&#x52D5;&#x3092;&#x4F7F;&#x3046;&#x56E3;&#x4F53;&#x306B;&#x9001;&#x91D1;&#x304C;&#x884C;&#x308F;&#x308C;&#x307E;&#x3059;&#x3002;</p>
<h1 id="&#x30DE;&#x30FC;&#x30B1;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x6226;&#x7565;">&#x30DE;&#x30FC;&#x30B1;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x6226;&#x7565;</h1>
<p>Foxlottery&#x306E;&#x5B9D;&#x304F;&#x3058;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x8CB7;&#x308F;&#x306A;&#x304F;&#x3066;&#x3082;&#x3001;Twitter&#x3067;&#x30EA;&#x30C4;&#x30A4;&#x30FC;&#x30C8;&#x3001;&#x30D5;&#x30A9;&#x30ED;&#x30FC;&#x3057;&#x305F;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306B;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x30C1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x7121;&#x6599;&#x3067;&#x914D;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<h1 id="&#x5F53;&#x9078;&#x91D1;&#x984D;&#x30B7;&#x30DF;&#x30E5;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;">&#x5F53;&#x9078;&#x91D1;&#x984D;&#x30B7;&#x30DF;&#x30E5;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;</h1>
<p><img src="img/ja/winning_level.png" alt=""></p>
<h1 id="&#x958B;&#x767A;&#x8A08;&#x753B;">&#x958B;&#x767A;&#x8A08;&#x753B;</h1>
<p>2022Q2  Foxlottery(ERC20)&#x30C8;&#x30FC;&#x30AF;&#x30F3;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x305F;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x5229;&#x7528;&#x53EF;&#x80FD;&#x306B;&#x3059;&#x308B;, &#x30D0;&#x30B0;&#x30D0;&#x30A6;&#x30F3;&#x30C6;&#x30A3;&#x306E;&#x5B9F;&#x65BD;
2022Q3  &#x5B9D;&#x304F;&#x3058;&#x306E;&#x30ED;&#x30C3;&#x30AF;&#x8CC7;&#x91D1;&#x3092;DeFi&#x904B;&#x7528;, &#x4ED6;&#x306E;ERC20&#x30C8;&#x30FC;&#x30AF;&#x30F3;&#x3067;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x3068;&#x3057;&#x3066;&#x5229;&#x7528;&#x53EF;&#x80FD;&#x306B;&#x3059;&#x308B;
2022Q4  &#x5F53;&#x9078;&#x54C1;&#x3092;NFT&#x306B;&#x3057;&#x305F;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x5229;&#x7528;&#x53EF;&#x80FD;&#x306B;&#x3059;&#x308B;</p>
<h1 id="ico&#x8A08;&#x753B;">ICO&#x8A08;&#x753B;</h1>
<p>2022Q3 ICO</p>
<p>&#x7DCF;&#x767A;&#x884C;&#x91CF;: &#x672A;&#x6C7A;&#x5B9A;
&#x4F9B;&#x7D66;&#x91CF;: &#x672A;&#x6C7A;&#x5B9A;</p>
<h1 id="sdgs">SDGs</h1>
<p>SDGs(&#x6301;&#x7D9A;&#x53EF;&#x80FD;&#x306A;&#x958B;&#x767A;&#x76EE;&#x6A19;)&#x3092;&#x9054;&#x6210;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x30B0;&#x30ED;&#x30FC;&#x30D0;&#x30EB;&#x3067;&#x5206;&#x6563;&#x5316;&#x3055;&#x308C;&#x305F;&#x30C8;&#x30E9;&#x30B9;&#x30C8;&#x30EC;&#x30B9;&#x306A;&#x5B9D;&#x304F;&#x3058;&#x3092;&#x5229;&#x7528;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><img src="img/ja/SDGs.png" alt=""></p>
<h1 id="&#x5B9D;&#x304F;&#x3058;&#x306E;&#x5E02;&#x5834;&#x898F;&#x6A21;">&#x5B9D;&#x304F;&#x3058;&#x306E;&#x5E02;&#x5834;&#x898F;&#x6A21;</h1>
<p>&#x65E5;&#x672C;: 7,866&#x5104;&#x5186; 2018&#x5E74;&#x5EA6;
&#x5F15;&#x7528;&#x5143;: <a href="https://www.soumu.go.jp/main_content/000583736.pdf" target="_blank">https://www.soumu.go.jp/main_content/000583736.pdf</a></p>
<p>&#x4E16;&#x754C;: 2000&#x5104;&#x30C9;&#x30EB;</p>
<p>&#x4E16;&#x754C;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x5E02;&#x5834;&#x898F;&#x6A21;&#x306F;2020&#x5E74;&#x304B;&#x3089;2025&#x5E74;&#x307E;&#x3067;&#x3001;194.14&#x5104;&#x7C73;&#x30C9;&#x30EB;&#x5897;&#x52A0;&#x3059;&#x308B;&#x3002;
&#x5F15;&#x7528;&#x5143;: <a href="https://www.prnewswire.com/news-releases/lottery-market-size-to-grow-by-usd-194-14-bn--38-of-the-growth-from-apac--17-000-technavio-reports-301501174.html" target="_blank">https://www.prnewswire.com/news-releases/lottery-market-size-to-grow-by-usd-194-14-bn--38-of-the-growth-from-apac--17-000-technavio-reports-301501174.html</a></p>
<h1 id="&#x5404;&#x56FD;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x6CD5;&#x5F8B;">&#x5404;&#x56FD;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x6CD5;&#x5F8B;</h1>
<h2 id="&#x4E3B;&#x306A;&#x5148;&#x9032;&#x56FD;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x6CD5;&#x5F8B;">&#x4E3B;&#x306A;&#x5148;&#x9032;&#x56FD;&#x306E;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x6CD5;&#x5F8B;</h2>
<h3 id="&#x65E5;&#x672C;">&#x65E5;&#x672C;</h3>
<p>&#x5B9D;&#x304F;&#x3058;&#x306E;&#x767A;&#x884C;&#x3092;&#x4E00;&#x822C;&#x306E;&#x500B;&#x4EBA;&#x3084;&#x4F1A;&#x793E;&#x306A;&#x3069;&#x304C;&#x767A;&#x58F2;&#x3059;&#x308B;&#x3053;&#x3068;&#x306F;&#x3001;&#x5211;&#x6CD5;&#x7B2C;187&#x6761;&#x3067;&#x7981;&#x6B62;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
&#x5B9D;&#x304F;&#x3058;&#x3092;&#x767A;&#x58F2;&#x3067;&#x304D;&#x308B;&#x306E;&#x306F;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x6CD5;&#x5F8B;&#x300C;&#x5F53;&#x305B;&#x3093;&#x91D1;&#x4ED8;&#x8A3C;&#x7968;&#x6CD5;&#x300D;&#xFF08;&#x662D;&#x548C;23&#x5E74;&#x65BD;&#x884C;&#xFF09;&#x306B;&#x5B9A;&#x3081;&#x3089;&#x308C;&#x305F;&#x5168;&#x56FD;&#x90FD;&#x9053;&#x5E9C;&#x770C;&#x3068;20&#x6307;&#x5B9A;&#x90FD;&#x5E02;&#x3001;&#x3064;&#x307E;&#x308A;&#x5730;&#x65B9;&#x81EA;&#x6CBB;&#x4F53;&#x3067;&#x3059;&#x3002;&#x3053;&#x306E;&#x5730;&#x65B9;&#x81EA;&#x6CBB;&#x4F53;&#x304C;&#x3001;&#x7DCF;&#x52D9;&#x5927;&#x81E3;&#x306E;&#x8A31;&#x53EF;&#x3092;&#x5F97;&#x3066;&#x767A;&#x58F2;&#x5143;&#x3068;&#x306A;&#x308A;&#x3001;&#x767A;&#x58F2;&#x7B49;&#x306E;&#x4E8B;&#x52D9;&#x3092;&#x9280;&#x884C;&#x7B49;&#x306B;&#x59D4;&#x8A17;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>&#x5F15;&#x7528;&#x5143;: <a href="https://www.takarakuji-official.jp/about/structure.html" target="_blank">https://www.takarakuji-official.jp/about/structure.html</a></p>
<h3 id="&#x30A2;&#x30E1;&#x30EA;&#x30AB;">&#x30A2;&#x30E1;&#x30EA;&#x30AB;</h3>
<p>&#x65E5;&#x672C;&#x3068;&#x540C;&#x3058;&#x3067;&#x81EA;&#x6CBB;&#x4F53;&#x304C;&#x51FA;&#x3059;&#x5B9D;&#x304F;&#x3058;&#x306F;&#x8A31;&#x53EF;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
&#x5F15;&#x7528;&#x5143;: <a href="https://en.wikipedia.org/wiki/Lotteries_in_the_United_States#States_with_no_lotteries" target="_blank">https://en.wikipedia.org/wiki/Lotteries_in_the_United_States#States_with_no_lotteries</a></p>
<h3 id="&#x30C9;&#x30D0;&#x30A4;">&#x30C9;&#x30D0;&#x30A4;</h3>
<p>&#x5B97;&#x6559;&#x4E0A;&#x306E;&#x7406;&#x7531;&#x306B;&#x3088;&#x308A;&#x7981;&#x6B62;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x304C;&#x3001;&#x653F;&#x5E9C;&#x304C;&#x767A;&#x884C;&#x3059;&#x308B;&#x5B9D;&#x304F;&#x3058;&#x306E;&#x3088;&#x3046;&#x306A;&#x3082;&#x306E;&#x306F;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;
&#x30DE;&#x30EB;&#x30C1;&#x30DF;&#x30EA;&#x30AA;&#x30CD;&#x30A2;&#x3068;&#x3044;&#x3046;&#x5B9D;&#x304F;&#x3058;&#x306F;&#x30C9;&#x30D0;&#x30A4;&#x3001;&#x30A2;&#x30D6;&#x30C0;&#x30D3;&#x306E;&#x7A7A;&#x6E2F;&#x3067;&#x8CA9;&#x58F2;&#x3055;&#x308C;&#x3001;&#x5F53;&#x9078;&#x8005;&#x306F;100&#x4E07;&#x30C9;&#x30EB;&#x3092;&#x53D7;&#x3051;&#x53D6;&#x308A;&#x3001;&#x8ECA;&#x3084;&#x30AA;&#x30FC;&#x30C8;&#x30D0;&#x30A4;&#x306A;&#x3069;&#x306E;&#x4ED6;&#x306E;&#x8CDE;&#x54C1;&#x304C;&#x914D;&#x3089;&#x308C;&#x307E;&#x3059;&#x3002;
&#x5F15;&#x7528;&#x5143;: <a href="http://www.dubaicityguide.com/m/features/index.asp?id=8876#.YjatFJPP30o" target="_blank">http://www.dubaicityguide.com/m/features/index.asp?id=8876#.YjatFJPP30o</a></p>
<h2 id="&#x4EEE;&#x60F3;&#x901A;&#x8CA8;&#x3068;&#x30AA;&#x30F3;&#x30E9;&#x30A4;&#x30F3;&#x30AB;&#x30B8;&#x30CE;&#x304C;&#x5408;&#x6CD5;&#x306A;&#x5730;&#x57DF;">&#x4EEE;&#x60F3;&#x901A;&#x8CA8;&#x3068;&#x30AA;&#x30F3;&#x30E9;&#x30A4;&#x30F3;&#x30AB;&#x30B8;&#x30CE;&#x304C;&#x5408;&#x6CD5;&#x306A;&#x5730;&#x57DF;</h2>
<ul>
<li>&#x30DE;&#x30EB;&#x30BF;&#x5171;&#x548C;&#x56FD;</li>
<li>&#x30B8;&#x30D6;&#x30E9;&#x30EB;&#x30BF;&#x30EB;(&#x30A4;&#x30AE;&#x30EA;&#x30B9;)</li>
<li>&#x30DE;&#x30F3;&#x5CF6;</li>
<li>&#x30AA;&#x30EB;&#x30C0;&#x30CB;&#x30FC;&#x5CF6;</li>
<li>&#x30A2;&#x30A4;&#x30B9;&#x30E9;&#x30F3;&#x30C9;</li>
<li>&#x30AB;&#x30CA;&#x30C0;&#xFF08;&#x30AB;&#x30CA;&#x30EF;&#x30B1;&#xFF09;</li>
<li>&#x30AD;&#x30E5;&#x30E9;&#x30BD;&#x30FC;&#x5CF6;</li>
</ul>
<h3 id="&#x6700;&#x6709;&#x529B;&#x306A;&#x306E;&#x306F;&#x30DE;&#x30EB;&#x30BF;&#x5171;&#x548C;&#x56FD;">&#x6700;&#x6709;&#x529B;&#x306A;&#x306E;&#x306F;&#x30DE;&#x30EB;&#x30BF;&#x5171;&#x548C;&#x56FD;</h3>
<p>&#x5B9D;&#x304F;&#x3058;&#x306F;&#x898F;&#x5236;&#x3055;&#x308C;&#x3066;&#x304A;&#x3089;&#x305A;&#x3001;&#x30AA;&#x30F3;&#x30E9;&#x30A4;&#x30F3;&#x30AB;&#x30B8;&#x30CE;&#x306E;&#x30E9;&#x30A4;&#x30BB;&#x30F3;&#x30B9;&#x306E;&#x767A;&#x884C;&#x3092;&#x884C;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
&#x30AA;&#x30F3;&#x30E9;&#x30A4;&#x30F3;&#x30AB;&#x30B8;&#x30CE;&#x306E;&#x30E9;&#x30A4;&#x30BB;&#x30F3;&#x30B9;&#x3092;&#x6301;&#x305F;&#x306A;&#x304F;&#x3066;&#x3082;&#x3001;&#x5B9D;&#x304F;&#x3058;&#x4E8B;&#x696D;&#x3092;&#x59CB;&#x3081;&#x308B;&#x3053;&#x3068;&#x306F;&#x3067;&#x304D;&#x307E;&#x3059;&#x304C;&#x3001;&#x30E9;&#x30A4;&#x30BB;&#x30F3;&#x30B9;&#x3092;&#x53D6;&#x5F97;&#x3057;&#x305F;&#x65B9;&#x304C;&#x4FE1;&#x983C;&#x3092;&#x5F97;&#x3089;&#x308C;&#x307E;&#x3059;&#x3002;
&#x5F15;&#x7528;&#x5143;: <a href="https://thelawreviews.co.uk/title/the-gambling-law-review/malta" target="_blank">https://thelawreviews.co.uk/title/the-gambling-law-review/malta</a></p>
<p>&#x4EEE;&#x60F3;&#x901A;&#x8CA8;&#x306B;&#x3088;&#x308B;ICO&#x306F;&#x7533;&#x8ACB;&#x3059;&#x308C;&#x3070;&#x53EF;&#x80FD;
&#x5F15;&#x7528;&#x5143;: <a href="https://www.csbgroup.com/fintech/initial-coin-offering-ico-malta/" target="_blank">https://www.csbgroup.com/fintech/initial-coin-offering-ico-malta/</a></p>
<h1 id="&#x30C1;&#x30FC;&#x30E0;">&#x30C1;&#x30FC;&#x30E0;</h1>
<p>&#x9AD8;&#x6A4B;&#x8056;&#x5F25; / Seiya Takahashi
24&#x6B73;&#x3001;&#x65E5;&#x672C;&#x4EBA;&#x306E;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x3002;&#x65E5;&#x672C;&#x306E;&#x5927;&#x4F01;&#x696D;&#x3084;&#x30B9;&#x30BF;&#x30FC;&#x30C8;&#x30A2;&#x30C3;&#x30D7;&#x4F01;&#x696D;&#x306E;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x958B;&#x767A;&#x3092;&#x7D4C;&#x9A13;&#x3002;2022&#x5E74;&#x306B;Foxlottery&#x3092;&#x5275;&#x696D;&#x3002;
2016&#x5E74;&#x306B;&#x30D3;&#x30C3;&#x30C8;&#x30B3;&#x30A4;&#x30F3;&#x306B;&#x8208;&#x5473;&#x3092;&#x6301;&#x3061;&#x3001;&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x306E;&#x6982;&#x5FF5;&#x3092;&#x5B66;&#x3073;&#x3001;2020&#x5E74;&#x306B;Solidity&#x306B;&#x89E6;&#x308C;&#x59CB;&#x3081;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>github: <a href="https://github.com/PeterTakahashi" target="_blank">https://github.com/PeterTakahashi</a>
twitter: <a href="https://twitter.com/_PeterTakahashi" target="_blank">https://twitter.com/_PeterTakahashi</a></p>
<h2 id="&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x52DF;&#x96C6;">&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x52DF;&#x96C6;</h2>
<p>CFO
&#x8CC7;&#x91D1;&#x8ABF;&#x9054;&#x3001;&#x30D5;&#x30A1;&#x30A4;&#x30CA;&#x30F3;&#x30B9;</p>
<p>CTO
Solidity&#x3067;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30B3;&#x30F3;&#x30C8;&#x30E9;&#x30AF;&#x30C8;&#x958B;&#x767A;
React&#x3067;&#x30D5;&#x30ED;&#x30F3;&#x30C8;&#x30A8;&#x30F3;&#x30C9;&#x958B;&#x767A;</p>
<p>CMO
&#x30DE;&#x30FC;&#x30B1;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x3001;PR</p>
<p>CCO
discord&#x306A;&#x3069;&#x306E;&#x30B3;&#x30DF;&#x30E5;&#x30CB;&#x30C6;&#x30A3;&#x904B;&#x55B6;</p>
<p>&#x6B53;&#x8FCE;&#x6761;&#x4EF6;
&#x5168;&#x3066;&#x82F1;&#x8A9E;&#x3068;&#x65E5;&#x672C;&#x8A9E;&#x306E;&#x4E21;&#x65B9;&#x307E;&#x305F;&#x306F;&#x82F1;&#x8A9E;&#x306E;&#x307F;</p>
<h1 id="&#x6280;&#x8853;&#x4ED5;&#x69D8;&#x306B;&#x3064;&#x3044;&#x3066;">&#x6280;&#x8853;&#x4ED5;&#x69D8;&#x306B;&#x3064;&#x3044;&#x3066;</h1>
<h2 id="&#x4F7F;&#x7528;&#x30C4;&#x30FC;&#x30EB;">&#x4F7F;&#x7528;&#x30C4;&#x30FC;&#x30EB;</h2>
<p>Solidity
Hardhat
Alchemy</p>
<h2 id="&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;">&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;</h2>
<p>Solidity&#x3067;&#x958B;&#x767A;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3001;Ethereum&#x3001;Binance&#x3001;Polygon, Avalanche&#x306A;&#x3069;&#x3067;&#x4F7F;&#x7528;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;</p>
<h2 id="&#x5F53;&#x9078;&#x306E;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x6027;&#x3092;&#x62C5;&#x4FDD;&#x3059;&#x308B;&#x4ED5;&#x7D44;&#x307F;">&#x5F53;&#x9078;&#x306E;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x6027;&#x3092;&#x62C5;&#x4FDD;&#x3059;&#x308B;&#x4ED5;&#x7D44;&#x307F;</h2>
<p>Chainlink VRF&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3068;&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x4E0A;&#x3067;&#x691C;&#x8A3C;&#x53EF;&#x80FD;&#x306A;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x306A;&#x6570;&#x5B57;&#x3092;&#x53D6;&#x5F97;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
<a href="https://docs.chain.link/docs/chainlink-vrf/" target="_blank">https://docs.chain.link/docs/chainlink-vrf/</a></p>
<p>Chainlink VRF&#x306F;PancakeSwap&#x3084;PoolTogether&#x306A;&#x3069;&#x306E;&#x5229;&#x7528;&#x5B9F;&#x7E3E;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<h3 id="pancakeswap">PancakeSwap</h3>
<p>&#x30D0;&#x30A4;&#x30CA;&#x30F3;&#x30B9;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30C1;&#x30A7;&#x30FC;&#x30F3;&#x4E0A;&#x306E;DeFi&#x304C;&#x904B;&#x55B6;&#x3057;&#x3066;&#x3044;&#x308B;&#x5B9D;&#x304F;&#x3058;
<a href="https://pancakeswap.finance/lottery" target="_blank">https://pancakeswap.finance/lottery</a></p>
<h3 id="pooltogether">PoolTogether</h3>
<p>&#x640D;&#x5931;&#x306E;&#x51FA;&#x306A;&#x3044;&#x5B9D;&#x304F;&#x3058;&#x3001;DeFi&#x30D7;&#x30FC;&#x30EB;&#x3057;&#x3066;&#x5F97;&#x305F;&#x5229;&#x76CA;&#x3092;&#x30D7;&#x30FC;&#x30EB;&#x3057;&#x305F;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306B;&#x62BD;&#x9078;&#x3067;&#x5206;&#x914D;&#x3059;&#x308B;
<a href="https://PoolTogether.com/" target="_blank">https://PoolTogether.com/</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="en.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: English">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"日本語","level":"1.2.2","depth":2,"previous":{"title":"English","level":"1.2.1","depth":2,"path":"en.md","ref":"en.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-sharing","hide-published-with","intopic-toc"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"hide-published-with":{},"intopic-toc":{"isCollapsed":true,"isScrollspyActive":true,"label":"In this article","maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Foxlottery Whitepaper","gitbook":"*","description":"Foxlottery is a fully decentralized lottery using crypto assets and smart contracts."},"file":{"path":"ja.md","mtime":"2022-04-04T16:09:34.337Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-04-04T16:16:47.057Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-hide-published-with/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

